from docx import Document
from docx.shared import Inches
from docx.oxml import OxmlElement
from docx.oxml.ns import qn

document = Document()

document.add_heading('Document Title', 0)

p = document.add_paragraph('A plain paragraph having some ')
p.add_run('bold').bold = True
p.add_run(' and some ')
p.add_run('italic.').italic = True

document.add_heading('Heading, level 1', level=1)
document.add_paragraph('Intense quote', style='Intense Quote')

document.add_paragraph(
    'first item in unordered list', style='List Bullet'
)
document.add_paragraph(
    'first item in ordered list', style='List Number'
)


def p1():
    records = (
        ('B-1.', 'ΟΡΙΣΜΟΙ'),
        ('B-1.1.', 'Σύμβαση: Όπου στο παρόν αναφέρεται η σύμβαση ή η παρούσα ή το παρόν εννοείται το παρόν “Ιδιωτικό Συμφωνητικό Τήρησης Εχεμύθειας- Εμπιστευτικότητας-Μη Αποκάλυψης”  μαζί με τα τυχόν Παραρτήματα του, τα οποία οποία αποτελούν αναπόσπαστο τμήμα του '),
        ('B-1.2.', 'Συμβαλλόμενα Μέρη/Μέρη: Όπου στο παρόν αναφέρονται τα «Μέρη» ή τα «Συμβαλλόμενα Μέρη» νοούνται αμφότεροι οι συμβαλλόμενοι που υπογράφουν την παρούσα σύμβαση και τα υπ’  αυτούς εκπροσωπούμενα πρόσωπα (νομικά, φυσικά, ενώσεις, κοκ). Αντίστοιχα, όπου στο παρόν αναφέρεται στον ενικό «Μέρος» ή «Συμβαλλόμενο Μέρος» εννοείται εξίσου οποιοσδήποτε των δύο, ως άνω, εδώ συμβαλλομένων.'),
        ('B-1.3', 'Πάροχος: Όπου στο παρόν αναφέρεται Πάροχος νοείται το συμβαλλόμενο  Μέρος που αποκαλύπτει τις Εμπιστευτικές Πληροφορίες. '),
        ('B-1.4.', 'Αποδέκτες /Αποδέκτης: Όπου στο παρόν αναφέρεται «Αποδέκτης/ες» νοούνται εξίσου καθένα από τα Συμβαλλόμενα Μέρη, που λαμβάνουν τις Εμπιστευτικές Πληροφορίες του άλλου Μέρους. '),
        ('B-1.5.', 'Αντικείμενο του παρόντος: Η εξασφάλιση της προστασίας των πληροφοριών που ανταλλάσσονται από τα Μέρη στα πλαίσια της μεταξύ των επικοινωνίας και ανταλλαγής πληροφοριών καθώς και  της κοινής τους δράσης και  εν γένει συνεργασίας τους,  υπό τους όρους και τις συμφωνίες του παρόντος.')
    )

    table = document.add_table(rows=0, cols=2)
    table.style = 'Table Grid'

    # Add rows with data
    for key, value in records:
        row = table.add_row()
        row.cells[0].width = Inches(1.2)
        row.cells[1].width = Inches(5.5)
        row.cells[0].text = key
        row.cells[1].text = value

    i=1
    for row in table.rows:
        i=i+1
        if i == 2:
            row.height = Inches(0.7)

    document.add_paragraph()
    


def p2():
    records = (
        ('Γ-1.', 'ΠΡΟΟΙΜΙΟ/ΣΚΟΠΟΣ'),
        ('Γ-1.1.', 'Οι στο παρόν συμβαλλόμενοι έχουν συμφωνήσει και συναποφασίσει να εισέλθουν σε συζητήσεις και ανταλλαγή πληροφοριών και επισκέψεων με σκοπό να διερευνήσουν τις δυνατότητες επίτευξης συμφωνιών και/ή συνεργειών και/ή συνεργασιών και /ή συμβάσεων σε εταιρικό επίπεδο (εφεξής καλούμενος ως «ο Σκοπός»).  '),
        ('Γ-1.2.', 'Τα Συμβαλλόμενα Μέρη συνομολογούν και συναποδέχονται  ότι για την εκπλήρωση του άνω Σκοπού είναι αναγκαίο τα Μέρη να προβούν στην αποκάλυψη Εμπιστευτικών Πληροφοριών και Απορρήτων και/ή να χορηγήσουν αμοιβαίως πρόσβαση σε πληροφόρηση και δεδομένα που αποτελούν ιδιοκτησία του κάθε Μέρους και/ή άϋλα αγαθά και προϊόντα της διανοίας προστατευόμενα από αποκλειστικά δικαιώματα πνευματικής ιδιοκτησίας των Μερών καθώς και ότι το ως άνω διερευνητικό στάδιο είναι το απαραίτητο προηγούμενο και προϋπόθεση  του επόμενου βήματος δηλαδή είτε του αζήμιου τερματισμού κάθε περαιτέρω συζήτησης ή της κατάρτισης και υπογραφής Μνημονίου (ή Προσυμφώνου ) Συνεργασίας (“ΜΟΑ”).'),
        ('Γ-1.3', 'Για τους λόγους τούτους  τα Συμβαλλόμενα Μέρη αναγνωρίζουν και ρητά συμφωνούν, συνομολογούν και συναποδέχονται ότι παρίσταται ανάγκη προστασίας και διασφάλισης όλων των Εμπιστευτικών Πληροφοριών που θα αποκαλύψουν αμοιβαίως  στο ως άνω πλάισιο και για το σκοπό αυτό συμφωνούν, συνομολογούν,καταρτίζουν, συνυπογράφουν και θέτουν σε ισχύ το παρόν δεσμευτικό Ιδιωτικό Συμφωνητικό Τήρησης Εχεμύθειας-Εμπιστευτικότητας-Μη Αποκάλυψης, το  οποίο θα δεσμεύει εφεξής τα Μέρη και θα διέπει κάθε παρούσα και μελλοντική μεταξύ τους επικοινωνία, ανταλλαγή πληροφοριών, συνεργασία και σύμβαση. ')
    )

    table = document.add_table(rows=0, cols=2)
    table.style = 'Table Grid'

    # Add rows with data
    for key, value in records:
        row = table.add_row()
        row.cells[0].width = Inches(1.2)
        row.cells[1].width = Inches(5.5)
        row.cells[0].text = key
        row.cells[1].text = value

    i=1
    for row in table.rows:
        i=i+1
        if i == 2:
            row.height = Inches(0.3)

    document.add_paragraph()

def p3():
    records = (
        ('Γ-2.', 'ΕΜΠΙΣΤΕΥΤΙΚΟΤΗΤΑ/ΕΧΕΜΥΘΕΙΑ'),
        ('Γ-2.1.', 'Στα πλαίσια του ανωτέρω Σκοπού και της ως άνω προγραφείσης μεταξύ των Μερών συνεργασίας,  επικοινωνίας και συνάφειας και για τις ανάγκες αυτών παρίσταται αναγκαίο κάθε Μέρος  να αποκαλύπτει (Πάροχος) στο άλλο Μέρος (Αποδέκτη) πληροφορίες εμπιστευτικού χαρακτήρα ("εμπιστευτικές πληροφορίες") και να παρέχει  πρόσβαση στο άλλο μέρος σε εμπιστευτικές πληροφορίες του.  '),
        ('Γ-2.2.', 'Για το λόγο αυτό , αντιστοίχως, τα Μέρη συμφωνούν, συνομολογούν και αποδέχονται να λαμβάνουν αμοιβαίως τέτοια αποκάλυψη εμπιστευτικών πληροφορίιών καθώς και  και πρόσβαση σε εμπιστευτικές πληροφορίες του άλλου Μέρους, τις οποίες  υποχρεούνται και ρητά δεσμεύονται και αναλαμβάνουν ως “Υπόχρεοι” να  μην χρησιμοποιήσουν  για κανένα άλλο λόγο παρά μόνο αποκλειστικά για τις ανάγκες του Σκοπού στο απολύτως αναγκαίο μέτρο και αυστηρά μέσα στα όρια αυτού  υπό τους όρους του παρόντος συμφωνητικού. '),
        ('Γ-2.3.', 'Ο όρος «Εμπιστευτική Πληροφορία» περιλαμβάνει:\n- Οποιαδήποτε πληροφορία περιέρχεται σε γνώση του Υπόχρεου συνεπεία, εξ αφορμής ή και επ΄ ευκαιρίας του παρόντος συμφωνητικού και κάθε παρούσας ή μελλοντικής μεταξύ των μερών εν γένει συνεργασίας,  επικοινωνίας ή συνάφειας. Οι Εμπιστευτικές Πληροφορίες μπορεί να είναι γραπτές, προφορικές, ηλεκτρονικές, ψωτογραφικές, ψηφιακές ή και οποιασδήποτε άλλης και καλύπτονται από την παρούσα συμφωνία χωρίς να απαιτείται να χαρακτηρίζονται ρητά ως τέτοιες , ανεξάρτητα από το εάν φέρουν ή όχι ειδική ρητή ένδειξη (“Απόρρητο” ή ¨Εμπιστευτικό”  ή  άλλη) και ανεξάρτητα από την τυχόν υποκειμενική αντίληψη ή κρίση των Μερών περί της φύσεως εκάστης πληροφορίας ως εμπιστευτικής ή μη.'),
        ('Γ-2.4.', 'Ο όρος «Εμπιστευτική Πληροφορία» περιλαμβάνει:\n- Το σύνολο των  πληροφοριών, δεδομένων, των οποίων κέκτηται το κάθε Μέρος  και τις οποίες αποκαλύπτει ή/και με άλλο τρόπο καθιστά προσβάσιμες στον άλλο Μέρος.\n-Κάθε κεκτημένη  ειδική τεχνογνωσία (σχεδίων, οδηγιών, τεχνικών, εμπειρίας κοκ) των Μερών στο αντικείμενο τους καθώς τους κανόνες, μεθόδους, πρακτικές διαδικασίες, μέσα και συστήματα εργασίας και παροχής υπηρεσιών που έχουν αναπτυχθεί από τα Μέρη.\n- Περιλαμβάνονται στην «Εμπιστευτική Πληροφορία»- ενδεικτικά και όχι περιοριστικά- πληροφορίες σχετικές με τις εργασίες του κάθε Μέρους (διοικητικές, οικονομικές, εσωτερικής οργάνωσης, πληροφοριακών συστημάτων, χρηματοοικονομικές, νομικές, προμηθευτών, αντιπροσωπειών, πελατών, δικτύων, συνεργατών, ανταγωνισμού, τιμολογιακής πολιτικής κ.ο.κ) και εν γένει πληροφορίες κάθε Μέρους σχετικές με πολιτικές, επιχειρηματικά σχέδια και στρατηγικές ανάπτυξης, με χρηματοοικονομικά στοιχεία, ισολογισμούς, κερδοφορία και επενδυτικά σχέδια, με ανθρώπινο δυναμικό, πελάτες, προμηθευτές, συνεργάτες και στρατηγικές μάρκετινγκ, με αντιπροσωπείες, δικαιώματα διανομής και εν γένει συμβάσεις και νομικές συμφωνίες που σχετίζονται με την επιχείρηση, με εμπορεύματα, προϊόντα, πρώτες ύλες, τεχνικές και σχέδια, εμπορικά μυστικά, μεθόδους παραγωγής, τεχνικές διαδικασίες, τεχνογνωσία και εμπειρία, άδειες και δικαιώματα χρήσης, ευρεσιτεχνίες, πατέντες, και πνευματικά δικαιώματα, με αλγορίθμους λογισμικό,  προγράμματα ηλεκτρονικών υπολογιστών, μηχανογράφηση, λογιστική και οικονομική διαχείριση, σχετικά με την διοίκηση τους μετόχους κοκ.\n- Άπαντα τα ανωτέρω ως σύνολο συνιστούν και αποτελούν ως περιεχόμενο την    «Εμπιστευτική Περιουσία» του κάθε Μέρους, η οποία αποτελεί άυλο περιουσιακό στοιχείο υψίστης σημασίας και αξίας, η προστασία, διαφύλαξη και μη αποκάλυψη της οποίας συνιστά όρο για την διασφάλιση, προστασία και προαγωγή των εργασιών και των σκοπών κάθε Μέρους. '),

    )

    table = document.add_table(rows=0, cols=2)
    table.style = 'Table Grid'

    # Add rows with data
    for key, value in records:
        row = table.add_row()
        row.cells[0].width = Inches(1.2)
        row.cells[1].width = Inches(5.5)
        row.cells[0].text = key
        row.cells[1].text = value

    i=1
    for row in table.rows:
        i=i+1
        if i == 2:
            row.height = Inches(0.3)


def p4():
    records = (
        ('Γ-3.', 'ΤΕΚΜΗΡΙΟ ΑΠΟΡΡΗΤΟΥ'),
        ('Γ-3.1.', ' Οσάκις ο Αποδέκτης αμφιβάλλει για το αν μία πληροφορία φέρει χαρακτήρα του εμπιστευτικού ή απορρήτου, οφείλει να ρωτήσει σχετικά τον Πάροχο για να λάβει την καθοριστική γνώμη του. Στο μεσοδιάστημα οφείλει να την προστατεύει ως απόρρητη.  ')

    )

    table = document.add_table(rows=0, cols=2)
    table.style = 'Table Grid'

    # Add rows with data
    for key, value in records:
        row = table.add_row()
        row.cells[0].width = Inches(1.2)
        row.cells[1].width = Inches(5.5)
        row.cells[0].text = key
        row.cells[1].text = value

    i=1
    for row in table.rows:
        i=i+1
        if i == 2:
            row.height = Inches(0.3)

def p5():
    records = (
        ('Γ-4.', 'ΕΞΑΙΡΕΣΕΙΣ'),
        ('Γ-4.1.', ' Εξαιρούνται της εμπιστευτικής περιουσίας και δεν θεωρούνται εμπιστευτικές και δεν καλύπτονται από το παρόν συμφωνητικό οι πληροφορίες, οι οποίες:\n(α)  Έχουν προηγουμένως με πρόθεση καταστεί από το ενδιαφερόμενο Μέρος  δημόσια γνωστές και ελευθέρως προσβάσιμες. Τέτοια δημοσιοποίηση εφόσον τυγχάνει ακούσια ή από παραδρομή ή τελείται ως αποτέλεσμα παράνομης πράξης ή παράλειψης  του Μέρους (ή των υπαλλήλων ή / και των εν γένει προστηθέντων του)  δεν αναιρεί τον χαρακτήρα των πληροφοριών ως εμπιστευτικών και δεν τις εξαιρεί από τις  απαγορεύσεις του παρόντος \n(β) Έχουν αναπτυχθεί  ανεξάρτητα από τον Αποδέκτη και Υπόχρεο, χωρίς καμία χρήση ή  επεξεργασία των αποκαλυφθέντων εμπιστευτικών πληροφοριών\n(γ) Η αποκάλυψη τους επιβάλλεται από υποχρεωτική απόφαση δικαστηρίου ή αρμόδιας προς τούτο κυβερνητικής υπηρεσίας/αρχής')

    )

    table = document.add_table(rows=0, cols=2)
    table.style = 'Table Grid'

    # Add rows with data
    for key, value in records:
        row = table.add_row()
        row.cells[0].width = Inches(1.2)
        row.cells[1].width = Inches(5.5)
        row.cells[0].text = key
        row.cells[1].text = value

    i=1
    for row in table.rows:
        i=i+1
        if i == 2:
            row.height = Inches(0.3)

def p6():
    records = (
        ('Γ-5.', 'ΑΡΣΗ ΥΠΟΧΡΕΩΣΗΣ ΕΜΠΙΣΤΕΥΤΙΚΟΤΗΤΑΣ'),
        ('Γ-5.1.', ' Σε κάθε ως άνω υπό Γ-4.1(γ) περίπτωση, η ο Αποδέκτης  πριν από κάθε αποκάλυψη υποχρεούται να προβεί σε έγκαιρη ειδοποίηση του Παρόχου, ώστε ο τελευταίος να μπορεί να αναζητήσει κατάλληλη προστασία ή/και να προβεί σε ενέργειες για αποδέσμευση του Αποδέκτη από την υποχρέωση αποκάλυψης.  Εάν ο  Αποδέκτης -ελλείψει προστατευτικής εντολής ή με άλλο τρόπο αποδέσμευσής του - παραμένει νομικά υποχρεωμένος να αποκαλύψει Εμπιστευτικές Πληροφορίες,  τότε  μπορεί  δυνάμει του παρόντος,χωρίς ευθύνη του να αποκαλύψει τις πληροφορίες  υπό τον όρο, ωστόσο, ότι ο Αποδέκτης  θα αποκαλύψει μόνο εκείνο το τμήμα των Εμπιστευτικών Πληροφοριών που είναι απολύτως απαραίτητο.')

    )

    table = document.add_table(rows=0, cols=2)
    table.style = 'Table Grid'

    # Add rows with data
    for key, value in records:
        row = table.add_row()
        row.cells[0].width = Inches(1.2)
        row.cells[1].width = Inches(5.5)
        row.cells[0].text = key
        row.cells[1].text = value

    i=1
    for row in table.rows:
        i=i+1
        if i == 2:
            row.height = Inches(0.3)

    document.add_paragraph()

def p7():
    records = (
        ('                                                Δ. ΥΠΟΧΡΕΩΣΕΙΣ ΚΑΙ ΔΙΚΑΙΩΜΑΤΑ ΜΕΡΩΝ',),  # Comma added to make it a tuple of tuples
    )

    table = document.add_table(rows=0, cols=1)  # At least 1 column
    table.style = 'Table Grid'

    for value, in records:  # Unpack the single-element tuple
        row = table.add_row()
        row.cells[0].text = value  # Access the first cell

    i=1
    for row in table.rows:
        i=i+1
        if i == 2:
            row.height = Inches(0.3)

    document.add_paragraph()

def p8():
    records = (
        ('Δ-1.', 'ΥΠΟΧΡΕΩΣΕΙΣ ΑΠΟΔΕΚΤΗ'),
        ('Δ-1.1.', 'Τα Μέρη,  ως  Υπόχρεοι -Αποδέκτες πληροφοριών  ρητά συμφωνούν και  συνομολογούν άπαντα και ρητά αναγνωρίζουν ότι κάθε  ως άνω «Εμπιστευτική Περιουσία» του άλλου Μέρους  που θα έρχεται σε γνώση τους αποτελούν άυλη περιουσία υψίστης σημασίας και ευαίσθητα επιχειρηματικά απόρρητα και προσωπικά δεδομένα . '),
        ('Δ-1.2.', 'Τα Μέρη αναλαμβάνουν αμοιβαίως  ρητή υποχρέωση τήρησης αυστηρής εχεμύθειας, μη αποκάλυψης, μη ανακοίνωσης σε τρίτους και μη χρήσης οποιασδήποτε τέτοιας πληροφορίας εντασσόμενης κατά τα ανωτέρω στην «Εμπιστευτική Περιουσία» του  άλλου Μέρους. '),
        ('Δ-1.3.', 'Τα Μέρη δεσμεύονται να μην αποκαλύψουν ποτέ δια πράξεως ή παραλείψεως τους, ούτε με οποιονδήποτε τρόπο να γίνουν  αιτία να αποκαλυφθεί σε οποιονδήποτε τρίτο, φυσικό ή νομικό πρόσωπο, κάθε  τύπου ή μορφής, ανταγωνιστή η όχι, καθώς επίσης να μην κάνουν ποτέ χρήση, ούτε άλλως να εκμεταλλευτούν με οποιονδήποτε τρόπο, άμεσα ή έμμεσα, με δόλο ή αμέλεια, έστω και ελαφρά,  οποιαδήποτε τέτοια πληροφορίας εντασσόμενη κατά τα ανωτέρω στην «Εμπιστευτική Περιουσία» του  άλλου Μέρους. '),
        ('Δ-1.4.', 'Τα Μέρη δεσμεύονται να μεριμνούν και να προστατεύουν τις Εμπιστευτικές Πληροφορίες του άλλου Μέρους από πάσης φύσεως ακούσια αποκάλυψη σε τρίτους επιδεικνύοντας αυξημένη επιμέλεια και κατ΄ ελάχιστον με την ίδια μέριμνα και  επιμέλεια που επειδεικνύουν για την διαφύλαξη και προστασία των δικών τους εμπιστευτικών πληροφοριών απόρρητων. '),
        ('Δ-1.5.', 'Τα Μέρη δεσμεύονται να ενημερώνουν προηγουμένως, αμελλητί και ενδελεχώς το άλλο Μέρος σε κάθε περίπτωση που τυχόν κληθούν προς αποκάλυψη  Εμπιστευτικών Πληροφοριών σε τρίτους και προτού προβούν σε οποιαδήποτε τέτοια αποκάλυψη, ακόμη και εάν τούτη παρίσταται ως υποχρεωτική. '),
        ('Δ-1.6.', 'Σε περίπτωση κατά την οποία η Συνεργασία μεταξύ των εδώ Συμβαλλομένων Μερών διακοπεί για οποιοδήποτε λόγο, τα Μέρη υποχρεούνται χωρίς όχληση: Ι) να επιστρέψουν στο άλλο Μέρος ο,τιδήποτε διατηρούν στην κατοχή τους (πάσης φύσεως αρχεία ηλεκτρονικά, ψηφιακά, έγχαρτα ή άλλα, καθώς και  σημειώσεις, φωτοτυπίες, σχέδια, αντικείμενα, εξοπλισμό κ.ο.κ ) τα οποία σχετίζονται με τις εργασίες του άλλου Μέρους ή στα οποία ο/η Αποδέκτης εξακολουθεί να έχει πρόσβαση και ΙΙ) εφεξής   να απέχουν από οποιαδήποτε άμεση ή έμμεση , ολική ή μερική, χρήση ή εκμετάλλευση ή επεξεργασία ή αποκάλυψη των ανωτέρω . '),
        ('Δ-1.7.', 'Όλες οι Εμπιστευτικές Πληροφορίες που αποκαλύπτονται στο πλαίσιο της παρούσας ανήκουν και παραμένουν στην ιδιοκτησία του Παρόχου . Ο Αποδέκτης οφείλει, εφόσον του απευθύνεται τέτοιο αίτημα, σε άμεση επιστροφή ή καταστροφή όλων των αντιγράφων Εμπιστευτικών Πληροφοριών που του γνωστοποιούνται ή των οποίων έχει λάβει γνώση συνεπεία της πρόσβασης του σε αυτές καθώς και όλων των σημειώσεων, αρχείων και στοιχείων που σχετίζονται με αυτές τις Εμπιστευτικές Πληροφορίες.  '),
        ('Δ-1.8.', 'Εάν οι Εμπιστευτικές Πληροφορίες αποκαλύπτονται στο πλαίσιο διαπραγμάτευσης πιθανής εξαγοράς επιχείρησης, ισχύουν οι εξής πρόσθετοι όροι: α) Τα Μέρη δεσμεύονται να χρησιμοποιήσουν τις πληροφορίες αποκλειστικά για την αξιολόγηση της εξαγοράς και να μην προβούν σε καμία ανταγωνιστική ενέργεια εάν η εξαγορά δεν ολοκληρωθεί. β) Τα Μέρη δεσμεύονται ότι δεν θα επικοινωνήσουν άμεσα ή έμμεσα με υπαλλήλους, πελάτες ή προμηθευτές του άλλου μέρους για θέματα που σχετίζονται με την εξαγορά χωρίς την προηγούμενη ρητή και ειδική γραπτή συναίνεση του άλλου Μέρους. '),
        ('Δ-1.9.', 'Η αποκάλυψη Εμπιστευτικών Πληροφοριών στο προσωπικό, ανώτερους υπάλληλους, διευθυντές, διαχειριστές, συνδιαχειριστές, εταίρους, λοιπούς εντεταλμένους, τρίτους προστηθέντες,  βοηθητικό προσωπικό, συνεργάτες κοκ των Μερών θα γίνεται με ευθύνη των Μερών και μόνο σε εκείνο το μέτρο που είναι απολύτως απαραίτητο για την εκπλήρωση των σκοπών της παρούσας. Οποιαδήποτε αποκάλυψη πέραν του μέτρου αυτού απαγορεύεται αυστηρά. Τα Μέρη δεσμεύονται να μεριμνούν και να λαμβάνουν όλα τα κατάλληλα προληπτικά και προστατευτικά μέτρα ώστε κάθε ένας από το προσωπικό του, συμπεριλαμβανομένων ρητά ανώτερων υπάλληλων, διευθυντών, διαχειριστών, συνδιαχειριστών, εταίρων, λοιπών εντεταλμένων, τρίτων προστηθέντων,  βοηθητικού προσωπικού, συνεργατών κοκ, που  τυχόν αποκτά πρόσβαση στις Εμπιστευτικές Πληροφορίες να ενημερώνεται προσηκόντως για τον ιδιόκτητο και εμπιστευτικό τους χαρακτήρα και να υποχρεούνται προηγουμένως ρητώς  σε συμμόρφωση με τους όρους της παρούσας συμφωνίας. ')

    )

    table = document.add_table(rows=0, cols=2)
    table.style = 'Table Grid'

    # Add rows with data
    for key, value in records:
        row = table.add_row()
        row.cells[0].width = Inches(1.2)
        row.cells[1].width = Inches(5.5)
        row.cells[0].text = key
        row.cells[1].text = value

    i=1
    for row in table.rows:
        i=i+1
        if i == 2:
            row.height = Inches(0.3)

    document.add_paragraph()

def p9():
    records = (
        ('Δ-2.', 'ΔΙΚΑΙΩΜΑΤΑ ΠΑΡΟΧΟΥ'),
        ('Δ-2.1.', 'Τα Μέρη συμφωνούν ότι οι Εμπιστευτικές Πληροφορίες έχουν μεγάλη αξία για τον Πάροχο  και η προστασία και διαφύλαξη αυτών από το άλλο Μέρος στο οποίο αποκαλύπτονται είναι μείζωνος σημασίας και θεμελιώνουν δικαίωμα του Παρόχου να προβαίνει σε οποιαδήποτε νόμιμη ενέργεια (εξώδικη, δικαστική κοκ) και στην άσκηση οποιουδήποτε ενδίκου βοηθήματος/μέσου προκειμένου για την ρύθμιση και για την προσωρινή ή μη προστασία τους καθώς και για την αποζημίωση και αποκατάσταση οποιαδήποτε ζημίας τυχόν υποστεί ο Πάροχος από την αιτία αυτή, συμπεριλαμβανομένης κάθε άμεσης, έμμεσης και αποθετικής ζημίας του καθώς και από διαφυγόντα κέρδη, απώλεια ευκαιριών και εισοδήματος, προσβολή προϊόντος διανοίας, πνευματικής ιδιοκτησίας, ηθική βλάβη κοκ. '),
        ('Δ-2.2.', 'Καθυστέρηση ή παράλειψη εκ μέρους του Παρόχου στο να ασκήσει οποιοδήποτε δικαίωμα, απαίτηση ή αξίωση δυνάμει του παρόντος ή/και  ως αποτέλεσμα της μη συμμόρφωσης ή παράβασης εκ μέρους του Αποδέκτη τυχόν υποχρέωσης του σε σχέση με οποιονδήποτε από τους όρους της παρούσας Σύμβασης, δεν θα επηρεάσει οποιοδήποτε τέτοιο δικαίωμα απαίτηση ή αξίωση του Παρόχου και σε καμμία περίπτωση δεν μπορεί να θεωρηθεί ή ερμηνευθεί ως αποδυνάμωση  ή/και ως τοποποίηση ή παραίτηση από αυτά . '),
        ('Δ-2.3.', 'Όλα τα δικαιώματα πνευματικής ιδιοκτησίας, ευρεσιτεχνίας, όλα τα εμπορικά μυστικά και οι Εμπιστευτικές Πληροφορίες του Παρόχου συνιστούν και διατηρούνται και θα παραμείνουν αποκλειστικά δικαιώματα και πνευματική ιδιοκτησία του Παρόχου. Τίποτε στην παρούσα Σύμβαση και καμία αποκάλυψη ή παροχή πληροφοριών από τον Πάροχο προς τον Αποδέκτη,  δεν συνιστά, ούτε συνεπάγεται, ούτε υποκρύπτει ούτε άλλως μπορεί να νοηθεί ή να ερμηνευθεί ότι εμπεριέχει μεταβίβαση, εκχώρηση ή με οποιονδήποτε άλλον τρόπο αποξένωση του Παρόχου από δικαιώματα πνευματικής ιδιοκτησίας του, ούτε αδειοδότηση, ούτε παροχή άδειας χρήσης ή άδειας αναπαραγωγής, ούτε ως αναγνώριση τέτοιου συμφέροντος ή δικαιώματος στο πρόσωπο του Αποδέκτη.  '),
        ('Δ-2.4.', 'Στοιχεία λογισμικού, αλγορίθμων, ηλεκτρονικών υπηρεσιών που χρησιμοποιεί ο Πάροχος, το κόστος αγοράς, εγκατάστασης και συντήρησης αυτών,  συστήματα, προγράμματα που χρησιμοποιεί ο Πάροχος, κωδικοί πρόσβασης σε ηλεκτρονικά εργαλεία και εν γένει δεδομένα τεχνολογίας του Παρόχου, τα οποία θα αποκαλυφθούν στον Αποδέκτη ή άλλως θα τεθούν στη διάθεσή του αποτελούν επίσης Εμπιστευτικές Πληροφορίες και οι Αποδέκτες δεσμεύονται ως προς αυτά  σύμφωνα με τους όρους της παρούσας Σύμβασης .  '),
        ('Δ-2.5.', 'Μελέτες, σχέδια, τεχνικές προδιαγραφές και εν γένει οτιδήποτε έγγραφο τίθεται από τον Πάροχο στη διάθεση του Αποδέκτη στο πλαίσιο της του Σκοπού, συμφωνείται ρητά ότι συνιστούν αποκλειστική ιδιοκτησία του Παρόχου και εξακολουθούν να ανήκουν στον Πάροχο, όπως και τα πνευματικά δικαιώματα επ’ αυτών.  ')

    )

    table = document.add_table(rows=0, cols=2)
    table.style = 'Table Grid'

    # Add rows with data
    for key, value in records:
        row = table.add_row()
        row.cells[0].width = Inches(1.2)
        row.cells[1].width = Inches(5.5)
        row.cells[0].text = key
        row.cells[1].text = value

    i=1
    for row in table.rows:
        i=i+1
        if i == 2:
            row.height = Inches(0.3)

    document.add_paragraph()

def p10():
    records = (
        ('        Δ-3. ΔΕΔΟΜΕΝΑ ΠΡΟΣΩΠΙΚΟΥ ΧΑΡΑΚΤΗΡΑ',),  # Comma added to make it a tuple of tuples
        (' Προς εκπλήρωση των Σκοπών της παρούσης τα Συμβαλλόμενα Μέρη θα προβούν σε αποκάλυψη δεδομένων προσωπικού χαρακτήρα και στην επεξεργασία τους από το άλλο Μέρος. Ο όρος «δεδομένα προσωπικού χαρακτήρα» αναφέρεται σε κάθε πληροφορία που αφορά φυσικά πρόσωπα, η ταυτότητα των οποίων προσδιορίζεται ή μπορεί να προσδιορισθεί άμεσα ή έμμεσα, όπως για παράδειγμα το όνομα, ο αριθμός ταυτότητας, η διεύθυνση κατοικίας, η διεύθυνση ηλεκτρονικού ταχυδρομείου, , ή χαρακτηριστικά που προσδιορίζουν τη φυσιολογική, γενετική, ψυχολογική, οικονομική, πολιτιστική ή κοινωνική ταυτότητα του εν λόγω φυσικού προσώπου,  περιλαμβανομένης και της εικόνας ενός φυσικού προσώπου (φωτογραφικό υλικό, βίντεο). Τα Μέρη δεσμεύονται να διαφυλάττουν και να προστατεύουν την ασφάλεια και την εμπιστευτικότητα των δεδομένων προσωπικού χαρακτήρα, τα οποία περιέρχονται εις γνώση τους στο πλαίσιο εκπλήρωσης των συμβατικών τους υποχρεώσεων καθ’ όλη τη διάρκεια ισχύος της παρούσας Σύμβασης με το άλλο Μέρος, αλλά και μετά τη λήξη αυτής για οποιονδήποτε λόγο. Τα μέρη δεσμεύονται:\n1) Να συμμορφώνονται με τις σχετικές διατάξεις του Γενικού Κανονισμού για την Προστασία Δεδομένων [(ΕΕ) 2016/679 του ΕΥΡΩΠΑΪΚΟΥ ΚΟΙΝΟΒΟΥΛΙΟΥ ΚΑΙ ΤΟΥ ΣΥΜΒΟΥΛΙΟΥ της 27ης Απριλίου 2016 για την προστασία των φυσικών προσώπων έναντι της επεξεργασίας των δεδομένων προσωπικού χαρακτήρα και για την ελεύθερη κυκλοφορία των δεδομένων αυτών και την κατάργηση της οδηγίας 95/46/ΕΚ], του Ευρωπαϊκού και του ελληνικού δικαίου για την προστασία του ατόμου από την επεξεργασία δεδομένων προσωπικού χαρακτήρα και το απόρρητο των επικοινωνιών, καθώς και με τις πράξεις (Αποφάσεις, Οδηγίες, Γνωμοδοτήσεις κλπ.) που εκδίδονται από την Αρχή Προστασίας Δεδομένων Προσωπικού Χαρακτήρα.\n2)  Να λαμβάνουν ιδιαιτέρως υπόψη τη φύση κάθε επεξεργασίας δεδομένων προσωπικού χαρακτήρα και  τους κινδύνους που προκύπτουν από ή σε σχέση με αυτή, όπως η τυχαία ή παράνομη καταστροφή, απώλεια, μεταβολή, άνευ αδείας κοινοποίηση δεδομένων προσωπικού χαρακτήρα  ή η μη εξουσιοδοτημένη πρόσβαση  σε αυτά, η οποία θα μπορούσε να οδηγήσει σε σωματική, υλική ή μη υλική βλάβη και θα λαμβάνει όλα τα απαραίτητα μέτρα για την αποτροπή αυτών καθώς και  όλα τα κατάλληλα τεχνικά και οργανωτικά μέτρα προκειμένου να διασφαλίζεται το ανάλογο επίπεδο ασφάλειας έναντι των κινδύνων\n3) Να τηρούν τον εμπιστευτικό χαρακτήρα των δεδομένων προσωπικού χαρακτήρα του άλλου Μέρους,\n4) Να μην τα χρησιμοποιούν χωρίς γραπτή έγκριση του άλλου μέρους για προσωπικό τους όφελος ή Σκοπούς τρίτου μέρους\n5) Να μην προβαίνουν σε αθέμιτη ή μη εξουσιοδοτημένη κοινοποίηση, συλλογή, καταχώριση, αποθήκευση με οποιονδήποτε τρόπο των δεδομένων προσωπικού χαρακτήρα του άλλου Μέρους.\n6) Να αναφέρουν άμεσα, εγγράφως ή με τον πλέον πρόσφορο κατά περίπτωση τρόπο κάθε περιστατικό παραβίασης προσωπικών δεδομένων και Εμπιστευτικών Πληροφοριών που τυχόν θα υποπέσει στην αντίληψή του, να παρέχει όλες τις απαραίτητες πληροφορίες (φύση της παραβίασης, κατηγορίες δεδομένων, εκτιμώμενος αριθμός επηρεαζόμενων υποκειμένων των δεδομένων, εκτιμώμενες κ.α.) για την αντιμετώπιση της παραβίασης και τη διαχείριση των σχετικών ζητημάτων. Η ενημέρωση θα πρέπει να πραγματοποιείται αμέσως και το αργότερο εντός  δώδεκα ωρών από το χρονικό σημείο κατά το οποίο έλαβε γνώση της παραβίασης δεδομένων προσωπικού χαρακτήρα.  Επίσης, υποχρεούται να αναφέρει και οιαδήποτε υποψία έχει για τυχόν επικείμενο περιστατικό παραβίασης δεδομένων προσωπικού χαρακτήρα.\n7) Σε περίπτωση καθ’ οιονδήποτε τρόπο λύσης ή λήξης της Σύμβασης, στο βαθμό που προέβαιναν σε καθ’ οιονδήποτε τρόπο επεξεργασία δεδομένων προσωπικού χαρακτήρα υποχρεούνται να επιστρέψουν το σύνολο των δεδομένων προσωπικού χαρακτήρα του άλλου Μέρους που βρίσκονται στην κατοχή τους και όλα τα αντίγραφα αυτών που πιθανώς υπάρχουν, να παραδώσουν έγγραφα, φακέλους, ηλεκτρονικά αρχεία με πληροφορίες και να παύσουν να προβαίνει σε οιαδήποτε χρήση και επεξεργασία αυτών των πληροφοριών και δεδομένων και να μην μεταφέρουν, διαβιβάζουν ή καθ’ οιονδήποτε τρόπο κοινολογούν τα δεδομένα αυτά σε τρίτους τηρώντας απόλυτη εμπιστευτικότητα και εχεμύθεια.\n8) Τα Μέρη έχουν τα εξής δικαιώματα αναφορικά με τα προσωπικά δεδομένα τους: α)δικαίωμα ενημέρωσης, β)δικαίωμα πρόσβασης, γ)δικαίωμα διόρθωσης,  δ)δικαίωμα διαγραφής, ε)δικαίωμα περιορισμού της επεξεργασίας, στ) δικαίωμα στη φορητότητα των δεδομένων, ζ)δικαίωμα εναντίωσης στην επεξεργασία των προσωπικών τους δεδομένων, περιλαμβανομένης της εναντίωσης στην αυτοματοματοποιημένη λήψη αποφάσεων και στην κατάρτιση προφίλ, η)δικαίωμα υποβολής καταγγελίας στην Αρχή Προστασίας Δεδομένων Προσωπικού Χαρακτήρα.',)
    )

    table = document.add_table(rows=0, cols=1)  # At least 1 column
    table.style = 'Table Grid'

    for value, in records:  # Unpack the single-element tuple
        row = table.add_row()
        row.cells[0].text = value  # Access the first cell

    i=1
    for row in table.rows:
        i=i+1
        if i == 2:
            row.height = Inches(0.3)

    document.add_paragraph()



print("Hello i will be giving you options of what parts of the contract you would like to be added to the word document we are about to create\n")

user_input = input("Να προστεθεί η ενότητα ΣΤΟΙΧΕΙΑ ΣΥΜΒΑΛΛΟΜΕΝΩΝ στο έγγραφο; (Απαντάμε με Ν/Ο ή ν/ο )\n").strip().lower()
if user_input == "ν" or user_input == "n":
    print("Hello i am done\n")

user_input = input("Να προστεθεί η ενότητα ΟΡΙΣΜΟΙ στο έγγραφο; (Απαντάμε με Ν/Ο ή ν/ο )\n").strip().lower()
if user_input == "ν" or user_input == "n":
    p1()

user_input = input("Να προστεθεί η ενότητα ΠΡΟΟΙΜΙΟ/ΣΚΟΠΟΣ στο έγγραφο; (Απαντάμε με Ν/Ο ή ν/ο )\n").strip().lower()
if user_input == "ν" or user_input == "n":
    p2()

user_input = input("Να προστεθεί η ενότητα ΕΜΠΙΣΤΕΥΤΙΚΟΤΗΤΑ/ΕΧΕΜΥΘΕΙΑ στο έγγραφο; (Απαντάμε με Ν/Ο ή ν/ο )\n").strip().lower()
if user_input == "ν" or user_input == "n":
    p3()

user_input = input("Να προστεθεί η ενότητα ΤΕΚΜΗΡΙΟ ΑΠΟΡΡΗΤΟΥ στο έγγραφο; (Απαντάμε με Ν/Ο ή ν/ο )\n").strip().lower()
if user_input == "ν" or user_input == "n":
    p4()

user_input = input("Να προστεθεί η ενότητα ΕΞΑΙΡΕΣΕΙΣ στο έγγραφο; (Απαντάμε με Ν/Ο ή ν/ο )\n").strip().lower()
if user_input == "ν" or user_input == "n":
    p5()

user_input = input("Να προστεθεί η ενότητα ΑΡΣΗ ΥΠΟΧΡΕΩΣΗΣ ΕΜΠΙΣΤΕΥΤΙΚΟΤΗΤΑΣ στο έγγραφο; (Απαντάμε με Ν/Ο ή ν/ο )\n").strip().lower()
if user_input == "ν" or user_input == "n":
    p6()

user_input = input("Να προστεθεί η ενότητα ΥΠΟΧΡΕΩΣΕΙΣ ΚΑΙ ΔΙΚΑΙΩΜΑΤΑ ΜΕΡΩΝ στο έγγραφο; (Απαντάμε με Ν/Ο ή ν/ο )\n").strip().lower()
if user_input == "ν" or user_input == "n":
    p7()

user_input = input("Να προστεθεί η ενότητα ΥΠΟΧΡΕΩΣΕΙΣ ΑΠΟΔΕΚΤΗ στο έγγραφο; (Απαντάμε με Ν/Ο ή ν/ο )\n").strip().lower()
if user_input == "ν" or user_input == "n":
    p8()

user_input = input("Να προστεθεί η ενότητα ΔΙΚΑΙΩΜΑΤΑ ΠΑΡΟΧΟΥ στο έγγραφο; (Απαντάμε με Ν/Ο ή ν/ο )\n").strip().lower()
if user_input == "ν" or user_input == "n":
    p9()

user_input = input("Να προστεθεί η ενότητα ΔΕΔΟΜΕΝΑ ΠΡΟΣΩΠΙΚΟΥ ΧΑΡΑΚΤΗΡΑ στο έγγραφο; (Απαντάμε με Ν/Ο ή ν/ο )\n").strip().lower()
if user_input == "ν" or user_input == "n":
    p10()

# user_input = input("Να προστεθεί η ενότητα ΕΞΑΙΡΕΣΕΙΣ στο έγγραφο; (Απαντάμε με Ν/Ο ή ν/ο )\n").strip().lower()
# if user_input == "ν" or user_input == "n":
#     p11()

# user_input = input("Να προστεθεί η ενότητα ΕΞΑΙΡΕΣΕΙΣ στο έγγραφο; (Απαντάμε με Ν/Ο ή ν/ο )\n").strip().lower()
# if user_input == "ν" or user_input == "n":
#     p12()

# user_input = input("Να προστεθεί η ενότητα ΕΞΑΙΡΕΣΕΙΣ στο έγγραφο; (Απαντάμε με Ν/Ο ή ν/ο )\n").strip().lower()
# if user_input == "ν" or user_input == "n":
#     p13()

# user_input = input("Να προστεθεί η ενότητα ΕΞΑΙΡΕΣΕΙΣ στο έγγραφο; (Απαντάμε με Ν/Ο ή ν/ο )\n").strip().lower()
# if user_input == "ν" or user_input == "n":
#     p14()



document.save("definitions_table.docx")